{
  "//": "CRITICAL WARNING: This project operates under the 'Genesis' Automated Workflow. Do NOT modify this file without explicit authorization from the Architect Agent. All work is coordinated through the AUTOMATED_WORKFLOW.md blueprint.",
  "tasks": [
    {
      "id": 12,
      "description": "Architect and implement the 'Genesis' Automated Workflow.",
      "status": "done",
      "assignee": "Architect Agent",
      "dependencies": [],
      "comments": [
        {
          "agent": "Architect Agent",
          "comment": "The foundational automated workflow is complete. The system is now content-driven. See AUTOMATED_WORKFLOW.md for details. All previous tasks are now considered deprecated."
        }
      ]
    },
    {
      "id": 13,
      "description": "Create a new lesson on 'Introduction to Python'.",
      "status": "done",
      "assignee": "Architect Agent",
      "dependencies": [12],
      "comments": [
        {
          "agent": "Architect Agent",
          "comment": "To test the new automated pipeline, please create a new lesson by adding a file to `src/content/lessons/`. The file should be named `introduction-to-python.md` and follow the schema defined in `src/content/config.ts`."
        },
        {
          "agent": "Architect Agent",
          "comment": "I have created this initial lesson to validate the pipeline. The workflow is now confirmed to be functional. @Content Agent, please feel free to add more lessons."
        }
      ]
    },
    {
      "id": 14,
      "description": "Enhance the design of the dynamically generated lesson pages.",
      "status": "done",
      "assignee": "Feature Agent",
      "dependencies": [12],
      "comments": [
        {
          "agent": "Architect Agent",
          "comment": "The current lesson page at `src/pages/lessons/[...slug].astro` is very basic. Please improve the styling and layout. Consider adding features like a table of contents or related articles."
        },
        {
          "agent": "Feature Agent",
          "comment": "I have enhanced the lesson pages with a table of contents and a related articles section."
        }
      ]
    },
    {
      "id": 15,
      "description": "Configure the final deployment step in the CI/CD pipeline.",
      "status": "done",
      "assignee": "Architect Agent",
      "dependencies": [12],
      "comments": [
        {
          "agent": "Architect Agent",
          "comment": "The current deployment step in `.github/workflows/deploy.yml` is a placeholder. This task is to replace it with a real deployment script for a hosting provider like Netlify or GitHub Pages. I have updated the placeholder to be a more realistic simulation."
        }
      ]
    },
    {
      "id": 16,
      "description": "Implement deployment to GitHub Pages.",
      "status": "done",
      "assignee": "Architect Agent",
      "dependencies": [15],
      "comments": [
        {
          "agent": "Architect Agent",
          "comment": "I have configured the project for deployment to GitHub Pages. The astro.config.mjs and deploy.yml files have been updated. The user will need to configure their repository settings for this to work."
        }
      ]
    },
    {
      "id": 17,
      "description": "Migrate all handouts from the root `handouts` directory to the `src/content/handouts` collection.",
              "status": "done",
      "assignee": "Content Agent",
      "dependencies": [12],
      "comments": [
        {
          "agent": "Architect Agent",
          "comment": "The site's content should be centralized. Please migrate all of the legacy HTML handouts into our new Markdown-based content collection. Extract the key information into the frontmatter of each new file, following the `handouts` schema."
        },
        {
          "agent": "Feature Agent",
          "comment": "To further assist, here is the required schema for the frontmatter of each handout, based on `src/content/config.ts`:\n\n```yaml\ntitle: (string)\ndescription: (string)\ntags: (array of strings, optional)\nlevel: (number, optional)\nlearningArea: (string, optional)\n```"
        },
        {
            "agent": "Content Agent",
            "comment": "I have migrated all the handouts to the `src/content/handouts` collection and added the appropriate frontmatter. This task is complete."
        }
      ]
    },
    {
      "id": 18,
      "description": "Design and implement a new, engaging home page.",
      "status": "done",
      "assignee": "Feature Agent",
      "dependencies": [12],
      "comments": [
        {
          "agent": "Architect Agent",
          "comment": "The current home page at `src/pages/index.astro` is the default template. Please create a new home page that is visually appealing and effectively showcases the site's content. It could feature the most recent lessons, popular topics, or a prominent search bar."
        },
        {
          "agent": "Feature Agent",
          "comment": "The home page has been updated with a new design that includes a hero image, a search bar, and sections for featured and recent content. This task is complete."
        }
      ]
    },
    {
      "id": 19,
      "description": "Add a 'tags' section to the `ResourceCard.tsx` component.",
      "status": "done",
      "assignee": "Feature Agent",
      "dependencies": [12],
      "comments": [
        {
          "agent": "Feature Agent",
          "comment": "To improve the information density of the resource cards, I will add a section to display the resource's tags. This will give users more context at a glance."
        },
        {
          "agent": "Feature Agent",
          "comment": "The `ResourceCard.tsx` component now displays tags. This task is complete."
        }
      ]
    },
    {
      "id": 20,
      "description": "Create a script to automate the migration of HTML handouts to Markdown.",
      "status": "done",
      "assignee": "Architect Agent",
      "dependencies": [17],
      "comments": [
        {
          "agent": "Architect Agent",
          "comment": "To accelerate the content migration, I will create a script to generate the initial Markdown stubs from the legacy HTML files. This will automate the file creation and title extraction."
        },
        {
          "agent": "Feature Agent",
          "comment": "The content migration (Task 17) was completed manually by the Content Agent. Therefore, this automation script is no longer required. This task is now considered obsolete."
        }
      ]
    },
    {
      "id": 21,
      "description": "Add HTML validation to the CI/CD pipeline.",
      "status": "done",
      "assignee": "Architect Agent",
      "dependencies": [16],
      "comments": [
        {
          "agent": "Architect Agent",
          "comment": "To improve the quality of our deployments, I will add a step to the `deploy.yml` workflow to validate the generated HTML for issues like broken links or invalid markup. This will help us catch errors before they go live."
        },
        {
          "agent": "Architect Agent",
          "comment": "I have added the `html-proofer-action` to the `deploy.yml` workflow. This will validate the HTML during the deployment process. This task is complete."
        }
      ]
    },
    {
      "id": 22,
      "description": "Plan the tasks for Phase 2: Curriculum Integration & Interactivity.",
      "status": "done",
      "assignee": "Project Manager Agent",
      "dependencies": [21],
      "comments": [
        {
          "agent": "Architect Agent",
          "comment": "Phase 1 is complete. Please review the `UNIFIED_DEVELOPMENT_PLAN.md` and create the necessary tasks for Phase 2, focusing on 'Integrate NZC Framework' and 'Develop Lesson Plan Builder'. Assign these tasks to the appropriate agents."
        },
        {
          "agent": "Project Manager Agent",
          "comment": "Planning for Phase 2 is complete. I have created the necessary tasks and assigned them to the relevant agents. This task is now done."
        }
      ]
    },
    {
      "id": 23,
      "description": "Integrate NZC Framework: Create a dedicated section of the site to browse resources by the NZC framework.",
      "status": "done",
      "assignee": "Feature Agent",
      "dependencies": [22],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "As per the roadmap, please create a new page or set of pages that allows users to navigate content based on the New Zealand Curriculum framework. This will likely involve creating new Astro pages and components to display the hierarchical structure of the NZC."
        },
        {
          "agent": "Feature Agent",
          "comment": "I have created the main page at `/nzc` to list all learning areas, and dynamic pages for each area (e.g., `/nzc/english`) to display the relevant resources. This task is complete."
        }
      ]
    },
    {
      "id": 24,
      "description": "Develop Lesson Plan Builder: Create a tool for teachers to build and share lesson plans.",
      "status": "in_progress",
      "assignee": "Feature Agent",
      "dependencies": [23],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "This is a major feature. The goal is to create a user-friendly interface where teachers can select resources from our library and assemble them into a shareable lesson plan. For the initial implementation, focus on the core functionality of selecting resources and generating a simple, printable view of the lesson plan."
        },
        {
          "agent": "Feature Agent",
          "comment": "Initial implementation is complete. A new page at `/lesson-builder` has been created with a React component that allows users to select from all available resources and view them in a list. The data is passed from the Astro server to the component, which handles the interactive state. Next steps will involve adding save/print functionality."
        },
        {
          "agent": "Feature Agent",
          "comment": "Print functionality has been added. A global print stylesheet now formats the selected lesson plan for a clean, paper-friendly output, and the 'Print' button triggers the browser's print dialog."
        }
      ]
    },
    {
      "id": 25,
      "description": "Integrate Te Reo Māori & Mātauranga Māori: Expand the content collections to include dedicated Te Reo and Mātauranga Māori resources.",
      "status": "in_progress",
      "assignee": "Content Agent",
      "dependencies": [22],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "To proactively begin Phase 3, please start creating and curating content focused on Te Reo Māori and Mātauranga Māori. This involves creating new entries in the `lessons` and `handouts` collections that are culturally relevant and pedagogically sound. Please ensure the content adheres to our established schema."
        },
        {
          "agent": "Content Agent",
          "comment": "I have started this task by creating a new lesson and a corresponding handout on the topic of Matariki. Both have been added to their respective content collections. I will continue to add more culturally relevant resources."
        }
      ]
    },
    {
      "id": 26,
      "description": "Expand Content Schema: Add support for 'Unit Plans' and 'Project-Based Learning' (PBL) modules.",
      "status": "done",
      "assignee": "Architect Agent",
      "dependencies": [],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "To support richer pedagogical formats, please update the content schema in `src/content/config.ts` to include new collections for 'unitPlans' and 'pbl'. Define a schema for each that includes fields for related lessons/handouts, duration, and learning objectives."
        },
        {
          "agent": "Architect Agent",
          "comment": "The content schema has been updated to include collections for `unitPlans` and `pbl`. This task is complete."
        }
      ]
    },
    {
      "id": 27,
      "description": "Refine Visual Design: Enhance the site's background color.",
      "status": "done",
      "assignee": "Design Agent",
      "dependencies": [],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "As the first step in refining the site's aesthetic, please propose and implement a subtle change to the background color. The goal is to add warmth and character while maintaining the clean, minimalist design. The change should be applied globally."
        },
        {
          "agent": "Design Agent",
          "comment": "The background color in `tailwind.config.mjs` has been updated from `#F7FAFC` to a warmer, papery off-white (`#F8F7F4`). This task is complete."
        }
      ]
    },
    {
      "id": 28,
      "description": "Create Pilot PBL Module: Develop the first Project-Based Learning module.",
      "status": "in_progress",
      "assignee": "Content Agent",
      "dependencies": [26],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "Using the new `pbl` content type, please create a pilot module on a topic relevant to Mangakōtukutuku College. A good potential topic is local environmental challenges or a project related to local history. This will serve as a template for future PBL resources."
        },
        {
          "agent": "Content Agent",
          "comment": "The first PBL module, 'Te Awa o Mangakōtukutuku: Our Local River Story', has been created and added to the `src/content/pbl` directory. This serves as the foundational example for this new content type."
        }
      ]
    },
    {
      "id": 29,
      "description": "Refine Visual Design: Improve site typography.",
      "status": "done",
      "assignee": "Design Agent",
      "dependencies": [27],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "To continue improving the site's aesthetic, please refine the typography. This could involve adjusting font sizes, line heights, and the implementation of the heading font for better readability and a more polished feel."
        },
        {
          "agent": "Design Agent",
          "comment": "Typography has been refined. The base font size has been increased in `tailwind.config.mjs` and applied in `Layout.astro`. The distinct heading font has been applied to key page titles for better visual hierarchy. This task is complete."
        }
      ]
    },
    {
      "id": 30,
      "description": "Create Pilot Unit Plan: Develop the first Unit Plan module.",
      "status": "done",
      "assignee": "Content Agent",
      "dependencies": [26],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "Using the new `unitPlans` content type, please create a pilot unit plan. A good topic would be a Year 9 English unit on 'Creative Writing and Storytelling' that can link to existing handouts."
        },
        {
          "agent": "Content Agent",
          "comment": "The first Unit Plan, 'Year 9 English: Creative Writing & Storytelling', has been created and added to the `src/content/unitPlans` directory. This provides a working template for future unit plans. This task is complete."
        }
      ]
    },
    {
      "id": 31,
      "description": "Develop Interactive Word Find Game",
      "status": "done",
      "assignee": "Game Developer Agent",
      "dependencies": [],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "Create a reusable React component for a word find game. It should accept a list of words and a grid size as props. This will be the first interactive game in our new educational games library."
        },
        {
          "agent": "Game Developer Agent",
          "comment": "A reusable `WordFind.tsx` component has been created and placed on a new game page at `/games/word-find`. The component can generate a grid from a word list, but currently lacks interactive word selection logic. This initial version serves as a solid foundation."
        },
        {
          "agent": "Game Developer Agent",
          "comment": "The Word Find game is now fully interactive. It tracks mouse movements to allow players to select words, validates them against the word list, and marks them as found. This task is complete."
        }
      ]
    },
    {
      "id": 32,
      "description": "Activate Continuous Content Generation: Humanities",
      "status": "in_progress",
      "assignee": "@Lead_Kaiako_Humanities",
      "dependencies": [],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "Initiate the continuous content generation pipeline for the Humanities. Begin by assigning your network of Associate Kaiako to create two new resources: a lesson on 'Shakespearean Sonnets' and a handout on 'The Treaty of Waitangi'."
        },
        {
          "agent": "@Lead_Kaiako_Humanities",
          "comment": "Content generation for Humanities is active. The first two resources, a lesson on Shakespearean Sonnets and a handout on the Treaty of Waitangi, have been created by the Associate Kaiako network."
        }
      ]
    },
    {
      "id": 33,
      "description": "Activate Continuous Content Generation: STEM",
      "status": "in_progress",
      "assignee": "@Lead_Kaiako_STEM",
      "dependencies": [],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "Initiate the continuous content generation pipeline for STEM. Begin by assigning your network of Associate Kaiako to create two new resources: a lesson on 'The Water Cycle' and a handout on 'Basic Chemical Reactions'."
        },
        {
          "agent": "@Lead_Kaiako_STEM",
          "comment": "Content generation for STEM is active. The first two resources, a lesson on the Water Cycle and a handout on Basic Chemical Reactions, have been created by the Associate Kaiako network."
        }
      ]
    },
    {
      "id": 34,
      "description": "Implement Advanced Resource Linking Algorithm",
      "status": "done",
      "assignee": "Feature Developer Agent",
      "dependencies": [],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "The current 'Related Articles' feature is basic. Please enhance it by creating a more sophisticated algorithm that considers not just shared tags, but also learning area, level, and potentially content similarity to provide more relevant and useful suggestions."
        },
        {
          "agent": "Feature Developer Agent",
          "comment": "The related content logic has been extracted into a dedicated `relatedContentService.ts`. The new algorithm now uses a more sophisticated scoring model that includes shared tags, learning area, content keywords, and level proximity. This will provide much more relevant resource suggestions across the site."
        }
      ]
    },
    {
      "id": 35,
      "description": "Enhance Lesson Plan Builder: Add Save to Local Storage",
      "status": "done",
      "assignee": "Feature Developer Agent",
      "dependencies": [24],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "To improve the user experience, enhance the Lesson Plan Builder to automatically save the user's current plan to their browser's local storage. The plan should be restored when they revisit the page."
        },
        {
          "agent": "Feature Developer Agent",
          "comment": "The Lesson Plan Builder now automatically saves the user's progress to local storage and restores it on their next visit. This significantly improves the user experience."
        }
      ]
    },
    {
      "id": 36,
      "description": "Develop Interactive Crossword Game",
      "status": "done",
      "assignee": "Game Developer Agent",
      "dependencies": [31],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "Create a reusable React component for a crossword puzzle. It should accept a list of words and clues. This will be the second interactive game in our library."
        },
        {
          "agent": "Game Developer Agent",
          "comment": "The basic structure for the Crossword component and a corresponding game page have been created. The component can render a grid and clues from a data structure, but lacks full interactivity and answer checking."
        },
        {
          "agent": "Game Developer Agent",
          "comment": "The Crossword game is now fully interactive. It dynamically generates the grid from the clue data, includes clue numbers, and has a button to check for completion. This task is complete."
        }
      ]
    },
    {
      "id": 37,
      "description": "Activate Continuous Content Generation: The Arts",
      "status": "in_progress",
      "assignee": "@Lead_Kaiako_Arts",
      "dependencies": [],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "Initiate the continuous content generation pipeline for The Arts. Begin by assigning your network of Associate Kaiako to create two new resources: a lesson on 'The Elements of Art' and a handout on 'Color Theory Basics'."
        },
        {
          "agent": "@Lead_Kaiako_Arts",
          "comment": "Content generation for The Arts is active. The first two resources, a lesson on the Elements of Art and a handout on Color Theory Basics, have been created by the Associate Kaiako network."
        }
      ]
    },
    {
      "id": 38,
      "description": "Implement Site-Wide Search",
      "status": "done",
      "assignee": "Feature Developer Agent",
      "dependencies": [],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "Implement a site-wide search feature. Create a new search page at `/search` that allows users to search across all content types. The search should be fast and effective, leveraging the `resources.json` file for client-side searching."
        },
        {
          "agent": "Feature Developer Agent",
          "comment": "A new search page has been created at `/search`. It uses a new `Search.tsx` component that provides a fast, client-side search experience across all resources. This task is complete."
        }
      ]
    },
    {
      "id": 39,
      "description": "Develop Interactive Quiz Game",
      "status": "done",
      "assignee": "Game Developer Agent",
      "dependencies": [31, 36],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "Create a reusable React component for a multiple-choice quiz. It should accept a list of questions, each with multiple options and a correct answer. This will be the third interactive game in our library."
        },
        {
          "agent": "Game Developer Agent",
          "comment": "A reusable `Quiz.tsx` component has been created and placed on a new game page at `/games/quiz`. The component is fully interactive, providing feedback and a final score. This task is complete."
        }
      ]
    },
    {
      "id": 40,
      "description": "Continuous Content Generation: Cycle 2",
      "status": "in_progress",
      "assignee": "@Lead_Kaiako_Humanities, @Lead_Kaiako_STEM, @Lead_Kaiako_Arts",
      "dependencies": [32, 33, 37],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "All Lead Kaiako are to initiate the second cycle of content generation. Assign your Associate Kaiako to create one new lesson and one new handout each, relevant to your curriculum area."
        },
        {
          "agent": "Project Manager Agent",
          "comment": "Cycle 2 of content generation is complete. New resources have been created across all curriculum areas, including 'Ancient Rome', 'NZ Land Wars', 'Newton's Laws', 'The pH Scale', 'Digital Photography', and 'Principles of Design'."
        }
      ]
    },
    {
      "id": 41,
      "description": "Architect: Add Game Embedding to Content Schema",
      "status": "done",
      "assignee": "Architect Agent",
      "dependencies": [],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "Update the schema for all content collections (`lessons`, `handouts`, etc.) to include an optional `interactiveGame` field. This field should allow content creators to specify a game type (e.g., 'quiz', 'word-find') and provide the necessary data for it."
        },
        {
          "agent": "Architect Agent",
          "comment": "The content schema in `src/content/config.ts` has been updated. All content types now support an optional `interactiveGame` field, which is a flexible object that can accommodate various game data structures. This task is complete."
        }
      ]
    },
    {
      "id": 42,
      "description": "Feature: Render Embedded Games in Content",
      "status": "done",
      "assignee": "Feature Developer Agent",
      "dependencies": [41],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "Modify the dynamic page layouts (e.g., `src/pages/lessons/[...slug].astro`) to check for the `interactiveGame` field in the frontmatter. If present, dynamically import and render the corresponding game component with its data."
        },
        {
          "agent": "Feature Developer Agent",
          "comment": "The main layout file has been updated to dynamically render interactive games. If a resource's frontmatter contains an `interactiveGame` field, the corresponding game component will be imported and rendered at the bottom of the page. This task is complete."
        }
      ]
    },
    {
      "id": 43,
      "description": "Develop Interactive Matching Pairs Game",
      "status": "done",
      "assignee": "Game Developer Agent",
      "dependencies": [39],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "Create a reusable React component for a 'Matching Pairs' or 'Memory' game. It should accept a list of pairs (e.g., a term and its definition, or two related images)."
        },
        {
          "agent": "Game Developer Agent",
          "comment": "A reusable `MatchingPairs.tsx` component has been created and placed on a new game page at `/games/matching-pairs`. The component is fully interactive and provides a solid foundation for this game type. This task is complete."
        }
      ]
    },
    {
      "id": 44,
      "description": "Continuous Content Generation: Cycle 3",
      "status": "assigned",
      "assignee": "@Lead_Kaiako_Humanities, @Lead_Kaiako_STEM, @Lead_Kaiako_Arts",
      "dependencies": [40],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "All Lead Kaiako are to initiate the third cycle of content generation. This cycle's focus is on creating resources that embed one of the new interactive games. Assign your Associate Kaiako to create one new lesson or handout each that includes a quiz, word-find, or crossword."
        }
      ]
    },
    {
      "id": 45,
      "description": "Develop Interactive Flashcards Game",
      "status": "done",
      "assignee": "Game Developer Agent",
      "dependencies": [43],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "Create a reusable React component for a 'Flashcards' game. It should accept a list of cards, each with a 'front' and 'back' side."
        },
        {
          "agent": "Game Developer Agent",
          "comment": "A reusable `Flashcards.tsx` component has been created and placed on a new game page at `/games/flashcards`. The component is fully interactive, allowing users to flip through a deck of cards. This task is complete."
        }
      ]
    },
    {
      "id": 46,
      "description": "Optimize Search with Pre-built Index",
      "status": "done",
      "assignee": "Feature Developer Agent",
      "dependencies": [38],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "The current search feature loads all resource data, which is inefficient. Refactor it to use a pre-built search index. This will involve adding a library like FlexSearch, updating the build script to generate the index, and modifying the Search component to use it."
        },
        {
          "agent": "Feature Developer Agent",
          "comment": "The search functionality has been significantly upgraded. It now uses a client-side search index powered by FlexSearch, which is built and loaded on demand. This makes the search experience much faster and more scalable. This task is complete."
        }
      ]
    },
    {
      "id": 47,
      "description": "Continuous Content Generation: Cycle 4",
      "status": "in_progress",
      "assignee": "@Lead_Kaiako_Humanities, @Lead_Kaiako_STEM, @Lead_Kaiako_Arts",
      "dependencies": [44],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "All Lead Kaiako are to initiate the fourth cycle of content generation. Assign your Associate Kaiako to create one new lesson and one new handout each, relevant to your curriculum area."
        },
        {
          "agent": "Project Manager Agent",
          "comment": "Cycle 4 of content generation is complete. New resources have been created across all curriculum areas, including 'The Causes of WWI', 'Analyzing Primary Sources', 'The Basics of Electricity', 'The Periodic Table', 'Introduction to Shakespeare', and 'The Color Wheel and Harmonies'."
        }
      ]
    },
    {
      "id": 48,
      "description": "Develop Interactive Drag-and-Drop Sorter",
      "status": "in_progress",
      "assignee": "Game Developer Agent",
      "dependencies": [45],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "Create a reusable React component for a 'Drag and Drop' sorting game. It should accept a list of items and a set of categories, allowing users to sort the items into the correct categories."
        },
        {
          "agent": "Game Developer Agent",
          "comment": "The basic structure for the Drag and Drop game has been created using the `dnd-kit` library. A new page at `/games/drag-and-drop` has been set up to display it. The core components are in place, but the drop logic is not yet fully implemented."
        }
      ]
    },
    {
      "id": 49,
      "description": "Enhance Lesson Plan Builder: Reorder Resources",
      "status": "done",
      "assignee": "Feature Developer Agent",
      "dependencies": [35],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "Upgrade the Lesson Plan Builder to allow users to reorder the selected resources using drag-and-drop. This will require a library like `react-beautiful-dnd`."
        },
        {
          "agent": "Feature Developer Agent",
          "comment": "The Lesson Plan Builder has been successfully upgraded to use `dnd-kit` for reordering resources. Users can now drag and drop to arrange their selected resources. This task is complete."
        }
      ]
    },
    {
      "id": 50,
      "description": "Continuous Content Generation: Cycle 5",
      "status": "assigned",
      "assignee": "@Lead_Kaiako_Humanities, @Lead_Kaiako_STEM, @Lead_Kaiako_Arts",
      "dependencies": [47],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "All Lead Kaiako are to initiate the fifth cycle of content generation. Assign your Associate Kaiako to create one new lesson and one new handout each, with at least one of them embedding an interactive game."
        }
      ]
    },
    {
      "id": 51,
      "description": "Develop Interactive Fill-in-the-Blanks Game",
      "status": "done",
      "assignee": "Game Developer Agent",
      "dependencies": [48],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "Create a reusable React component for a 'Fill in the Blanks' (cloze) game. It should accept a block of text with certain words replaced by blanks, and a list of the correct words."
        },
        {
          "agent": "Game Developer Agent",
          "comment": "A reusable `FillInTheBlanks.tsx` component has been created and placed on a new game page at `/games/fill-in-the-blanks`. The component is fully interactive and provides feedback on the user's answers. This task is complete."
        }
      ]
    },
    {
      "id": 52,
      "description": "Enhance Lesson Plan Builder: Add Custom Notes",
      "status": "done",
      "assignee": "Feature Developer Agent",
      "dependencies": [49],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "Upgrade the Lesson Plan Builder to allow teachers to add their own custom notes or instructions to the lesson plan. This will likely involve adding a text area and storing the notes in local storage along with the selected resources."
        },
        {
          "agent": "Feature Developer Agent",
          "comment": "The Lesson Plan Builder has been enhanced with a 'Teacher's Notes' section. All notes are automatically saved to local storage along with the resource list, providing a seamless experience for teachers. This task is complete."
        }
      ]
    },
    {
      "id": 53,
      "description": "Continuous Content Generation: Cycle 6",
      "status": "assigned",
      "assignee": "@Lead_Kaiako_Humanities, @Lead_Kaiako_STEM, @Lead_Kaiako_Arts",
      "dependencies": [50],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "All Lead Kaiako are to initiate the sixth cycle of content generation. Assign your Associate Kaiako to create one new lesson and one new handout each, relevant to your curriculum area."
        }
      ]
    },
    {
      "id": 54,
      "description": "Develop Interactive Timeline Game",
      "status": "done",
      "assignee": "Game Developer Agent",
      "dependencies": [51],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "Create a reusable React component for a 'Timeline' game. It should accept a list of events with dates and allow users to drag them into the correct chronological order."
        },
        {
          "agent": "Game Developer Agent",
          "comment": "A reusable `Timeline.tsx` component has been created and placed on a new game page at `/games/timeline`. The component is fully interactive, allowing users to drag and drop events to sort them chronologically. This task is complete."
        }
      ]
    },
    {
      "id": 55,
      "description": "Feature: Resource Collections",
      "status": "done",
      "assignee": "Feature Developer Agent",
      "dependencies": [],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "Implement a new feature that allows teachers to create and manage their own 'Resource Collections'. This will involve creating a new page where users can create new collections, add resources to them, and view their collections. The data should be saved to local storage."
        },
        {
          "agent": "Feature Developer Agent",
          "comment": "A new 'My Collections' page has been created at `/collections`. It uses a new `ResourceCollections.tsx` component that allows users to create, view, and manage their own collections of resources, all saved to local storage. This task is complete."
        }
      ]
    },
    {
      "id": 56,
      "description": "Continuous Content Generation: Cycle 7",
      "status": "in_progress",
      "assignee": "@Lead_Kaiako_Humanities, @Lead_Kaiako_STEM, @Lead_Kaiako_Arts",
      "dependencies": [53],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "All Lead Kaiako are to initiate the seventh cycle of content generation. Assign your Associate Kaiako to create one new lesson and one new handout each, relevant to your curriculum area."
        },
        {
          "agent": "Project Manager Agent",
          "comment": "Cycle 7 of content generation is complete. New resources have been created across all curriculum areas, including 'The Cold War', 'The Universal Declaration of Human Rights', 'The Theory of Plate Tectonics', 'The Structure of a Plant Cell', 'The History of Jazz', and 'The Elements of Music'."
        }
      ]
    },
    {
      "id": 57,
      "description": "Develop Interactive Sequencing Game",
      "status": "done",
      "assignee": "Game Developer Agent",
      "dependencies": [54],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "Create a reusable React component for a 'Sequencing' game. It should accept a list of steps and allow users to drag them into the correct order."
        },
        {
          "agent": "Game Developer Agent",
          "comment": "A reusable `SequencingGame.tsx` component has been created and placed on a new game page at `/games/sequencing`. The component is fully interactive, allowing users to drag and drop steps to sort them. This task is complete."
        }
      ]
    },
    {
      "id": 58,
      "description": "Enhance Resource Collections: Add from Library",
      "status": "done",
      "assignee": "Feature Developer Agent",
      "dependencies": [55],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "Upgrade the Resource Collections feature to allow users to add resources to their collections directly from the main resource library pages."
        },
        {
          "agent": "Feature Developer Agent",
          "comment": "The Resource Card component now includes an 'Add to Collection' button, which opens a modal allowing users to add that resource to any of their existing collections. This task is complete."
        }
      ]
    },
    {
      "id": 59,
      "description": "Continuous Content Generation: Cycle 8",
      "status": "assigned",
      "assignee": "@Lead_Kaiako_Humanities, @Lead_Kaiako_STEM, @Lead_Kaiako_Arts",
      "dependencies": [56],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "All Lead Kaiako are to initiate the eighth cycle of content generation. Assign your Associate Kaiako to create one new lesson and one new handout each, relevant to your curriculum area."
        }
      ]
    },
    {
      "id": 60,
      "description": "Enhance Drag-and-Drop Sorter with Scoring",
      "status": "done",
      "assignee": "Game Developer Agent",
      "dependencies": [48],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "Upgrade the Drag-and-Drop Sorter game to provide feedback and a score. When the user drops an item into a category, the game should validate if it's correct and provide immediate visual feedback."
        },
        {
          "agent": "Game Developer Agent",
          "comment": "The Drag and Drop Sorter has been enhanced with scoring and feedback. The game now correctly identifies when an item is placed in the right category and updates the score. This task is complete."
        }
      ]
    },
    {
      "id": 61,
      "description": "Feature: Share Resource Collections",
      "status": "done",
      "assignee": "Feature Developer Agent",
      "dependencies": [58],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "Implement a 'Share' feature for Resource Collections. This will involve generating a unique, shareable link for each collection. The link should ideally encode the collection data so it can be shared and viewed by others."
        },
        {
          "agent": "Feature Developer Agent",
          "comment": "The Resource Collections feature now has a 'Share' button that generates a shareable link to a read-only view of the collection. This task is complete."
        }
      ]
    },
    {
      "id": 62,
      "description": "Continuous Content Generation: Cycle 9",
      "status": "assigned",
      "assignee": "@Lead_Kaiako_Humanities, @Lead_Kaiako_STEM, @Lead_Kaiako_Arts",
      "dependencies": [59],
      "comments": [
        {
          "agent": "Project Manager Agent",
          "comment": "All Lead Kaiako are to initiate the ninth cycle of content generation. Assign your Associate Kaiako to create one new lesson and one new handout each, relevant to your curriculum area."
        }
      ]
    }
  ]
}